Borodkov/STM32-Advanced/STM32F7_Workshop_07_Scope/Src/LCDConf.c
/** @defgroup STEMWIN_LIBRARY_Private_Functions
    @{
*/

/*******************************************************************************
                       LTDC and DMA2D BSP Routines
*******************************************************************************/
/**
    @brief DMA2D MSP Initialization
           This function configures the hardware resources used in this example:
              - Peripheral's clock enable
              - Peripheral's GPIO Configuration
    @param hdma2d: DMA2D handle pointer
    @retval None
*/


/**
    @brief  Line Event callback.
    @param  hltdc: pointer to a LTDC_HandleTypeDef structure that contains
                   the configuration information for the specified LTDC.
    @retval None
*/
void HAL_LTDC_LineEvenCallback(LTDC_HandleTypeDef *hltdc) {
    uint32_t Addr;
    uint32_t layer;

    for (layer = 0; layer < GUI_NUM_LAYERS; layer++) {
        if (layer_prop[layer].pending_buffer >= 0) {
            /* Calculate address of buffer to be used  as visible frame buffer */
            Addr = layer_prop[layer].address + layer_prop[layer].xSize * layer_prop[layer].ySize * layer_prop[layer].pending_buffer * layer_prop[layer].BytesPerPixel;
            HAL_LTDC_SetAddress(hltdc, Addr, layer);
            __HAL_LTDC_RELOAD_CONFIG(hltdc);
            /* Notify STemWin that buffer is used */
            GUI_MULTIBUF_ConfirmEx(layer, layer_prop[layer].pending_buffer);
            /* Clear pending buffer flag of layer */
            layer_prop[layer].pending_buffer = -1;
        }
    }

    HAL_LTDC_ProgramLineEvent(hltdc, 0);
}

/*******************************************************************************
                          Display configuration
*******************************************************************************/
/**
    @brief  Called during the initialization process in order to set up the
             display driver configuration
    @param  None
    @retval None
*/
void LCD_X_Config(void) {
    uint32_t i;
    LCD_LL_Init();
    /* At first initialize use of multiple buffers on demand */
#if (NUM_BUFFERS > 1)

    for (i = 0; i < GUI_NUM_LAYERS; i++) {
        GUI_MULTIBUF_ConfigEx(i, NUM_BUFFERS);
    }

#endif
    /* Set display driver and color conversion for 1st layer */
    GUI_DEVICE_CreateAndLink(DISPLAY_DRIVER_0, COLOR_CONVERSION_0, 0, 0);

    /* Set size of 1st layer */
    if (LCD_GetSwapXYEx(0)) {
        LCD_SetSizeEx(0, YSIZE_PHYS, XSIZE_PHYS);
        LCD_SetVSizeEx(0, YSIZE_PHYS * NUM_VSCREENS, XSIZE_PHYS);
    } else {
        LCD_SetSizeEx(0, XSIZE_PHYS, YSIZE_PHYS);
        LCD_SetVSizeEx(0, XSIZE_PHYS, YSIZE_PHYS * NUM_VSCREENS);
    }

#if (GUI_NUM_LAYERS > 1)
    /* Set display driver and color conversion for 2nd layer */
    GUI_DEVICE_CreateAndLink(DISPLAY_DRIVER_1, COLOR_CONVERSION_1, 0, 1);

    /* Set size of 2nd layer */
    if (LCD_GetSwapXYEx(1)) {
        LCD_SetSizeEx(1, YSIZE_PHYS, XSIZE_PHYS);
        LCD_SetVSizeEx(1, YSIZE_PHYS * NUM_VSCREENS, XSIZE_PHYS);
    } else {
        LCD_SetSizeEx(1, XSIZE_PHYS, YSIZE_PHYS);
        LCD_SetVSizeEx(1, XSIZE_PHYS, YSIZE_PHYS * NUM_VSCREENS);
    }

#endif
    /*Initialize GUI Layer structure */
    layer_prop[0].address = LCD_LAYER0_FRAME_BUFFER;
#if (GUI_NUM_LAYERS > 1)
    layer_prop[1].address = LCD_LAYER1_FRAME_BUFFER;
#endif

    /* Setting up VRam address and custom functions for CopyBuffer-, CopyRect- and FillRect operations */
    for (i = 0; i < GUI_NUM_LAYERS; i++) {
        layer_prop[i].pColorConvAPI = (LCD_API_COLOR_CONV *)apColorConvAPI[i];
        layer_prop[i].pending_buffer = -1;
        /* Set VRAM address */
        LCD_SetVRAMAddrEx(i, (void *)(layer_prop[i].address));
        /* Remember color depth for further operations */
        layer_prop[i].BytesPerPixel = LCD_GetBitsPerPixelEx(i) >> 3;
        /* Set custom functions for several operations */
        LCD_SetDevFunc(i, LCD_DEVFUNC_COPYBUFFER, (void(*)(void))CUSTOM_CopyBuffer);
        LCD_SetDevFunc(i, LCD_DEVFUNC_COPYRECT, (void(*)(void))CUSTOM_CopyRect);

        /* Filling via DMA2D does only work with 16bpp or more */
        if (LCD_LL_GetPixelformat(i) <= LTDC_PIXEL_FORMAT_ARGB4444) {
            LCD_SetDevFunc(i, LCD_DEVFUNC_FILLRECT, (void(*)(void))CUSTOM_FillRect);
            LCD_SetDevFunc(i, LCD_DEVFUNC_DRAWBMP_8BPP, (void(*)(void))BSP_LCD_DrawBitmap8bpp);
        }

        /* Set up drawing routine for 16bpp bitmap using DMA2D */
        if (LCD_LL_GetPixelformat(i) == LTDC_PIXEL_FORMAT_RGB565) {
            LCD_SetDevFunc(i, LCD_DEVFUNC_DRAWBMP_16BPP, (void(*)(void))BSP_LCD_DrawBitmap16bpp);     /* Set up drawing routine for 16bpp bitmap using DMA2D. Makes only sense with RGB565 */
        }

        /* Set up custom color conversion using DMA2D, works only for direct color modes because of missing LUT for DMA2D destination */
        GUICC_M1555I_SetCustColorConv(Color2IndexBulk_M1555IDMA2D, Index2ColorBulk_M1555IDMA2D); /* Set up custom bulk color conversion using DMA2D for ARGB1555 */
        GUICC_M565_SetCustColorConv(Color2IndexBulk_M565DMA2D,   Index2ColorBulk_M565DMA2D);     /* Set up custom bulk color conversion using DMA2D for RGB565 */
        GUICC_M4444I_SetCustColorConv(Color2IndexBulk_M4444IDMA2D, Index2ColorBulk_M4444IDMA2D); /* Set up custom bulk color conversion using DMA2D for ARGB4444 */
        GUICC_M888_SetCustColorConv(Color2IndexBulk_M888DMA2D,   Index2ColorBulk_M888DMA2D);     /* Set up custom bulk color conversion using DMA2D for RGB888 */
        GUICC_M8888I_SetCustColorConv(Color2IndexBulk_M8888IDMA2D, Index2ColorBulk_M8888IDMA2D); /* Set up custom bulk color conversion using DMA2D for ARGB8888 */
        /* Set up custom alpha blending function using DMA2D */
        GUI_SetFuncAlphaBlending(DMA2D_AlphaBlending);                                                /* Set up custom alpha blending function using DMA2D */
        /*  Set up custom function for translating a bitmap palette into index values.
            Required to load a bitmap palette into DMA2D CLUT in case of a 8bpp indexed bitmap */
        GUI_SetFuncGetpPalConvTable(_LCD_GetpPalConvTable);
        /* Set up a custom function for mixing up single colors using DMA2D */
        GUI_SetFuncMixColors(DMA2D_MixColors);
        /* Set up a custom function for mixing up arrays of colors using DMA2D */
        GUI_SetFuncMixColorsBulk(LCD_MixColorsBulk);
    }
}

/**
    @brief  This function is called by the display driver for several purposes.
            To support the according task the routine needs to be adapted to
            the display controller. Please note that the commands marked with
            'optional' are not cogently required and should only be adapted if
            the display controller supports these features
    @param  LayerIndex: Index of layer to be configured
    @param  Cmd       :Please refer to the details in the switch statement below
    @param  pData     :Pointer to a LCD_X_DATA structure
    @retval Status (-1 : Error,  0 : Ok)
*/
int LCD_X_DisplayDriver(unsigned LayerIndex, unsigned Cmd, void *pData) {
    int32_t r = 0;
    uint32_t addr;
    int32_t xPos, yPos;
    uint32_t Color;

