Borodkov/STM32-Advanced/STM32F7_Workshop_07_Scope/Src/LCDConf.c
    switch (Cmd) {
        case LCD_X_INITCONTROLLER:
            LCD_LL_LayerInit(LayerIndex);
            break;

        case LCD_X_SETORG:
            addr = layer_prop[LayerIndex].address + ((LCD_X_SETORG_INFO *)pData)->yPos * layer_prop[LayerIndex].xSize * layer_prop[LayerIndex].BytesPerPixel;
            HAL_LTDC_SetAddress(&hltdc, addr, LayerIndex);
            break;

        case LCD_X_SHOWBUFFER:
            layer_prop[LayerIndex].pending_buffer = ((LCD_X_SHOWBUFFER_INFO *)pData)->Index;
            break;

        case LCD_X_SETLUTENTRY:
            HAL_LTDC_ConfigCLUT(&hltdc, (uint32_t *) & (((LCD_X_SETLUTENTRY_INFO *)pData)->Color), 1, LayerIndex);
            break;

        case LCD_X_ON:
            __HAL_LTDC_ENABLE(&hltdc);
            break;

        case LCD_X_OFF:
            __HAL_LTDC_DISABLE(&hltdc);
            break;

        case LCD_X_SETVIS:
            if (((LCD_X_SETVIS_INFO *)pData)->OnOff  == ENABLE) {
                __HAL_LTDC_LAYER_ENABLE(&hltdc, LayerIndex);
            } else {
                __HAL_LTDC_LAYER_DISABLE(&hltdc, LayerIndex);
            }

            __HAL_LTDC_RELOAD_CONFIG(&hltdc);
            break;

        case LCD_X_SETPOS:
            HAL_LTDC_SetWindowPosition(&hltdc,
                                       ((LCD_X_SETPOS_INFO *)pData)->xPos,
                                       ((LCD_X_SETPOS_INFO *)pData)->yPos,
                                       LayerIndex);
            break;

        case LCD_X_SETSIZE:
            GUI_GetLayerPosEx(LayerIndex, (int *)&xPos, (int *)&yPos);
            layer_prop[LayerIndex].xSize = ((LCD_X_SETSIZE_INFO *)pData)->xSize;
            layer_prop[LayerIndex].ySize = ((LCD_X_SETSIZE_INFO *)pData)->ySize;
            HAL_LTDC_SetWindowPosition(&hltdc, xPos, yPos, LayerIndex);
            break;

        case LCD_X_SETALPHA:
            HAL_LTDC_SetAlpha(&hltdc, ((LCD_X_SETALPHA_INFO *)pData)->Alpha, LayerIndex);
            break;

        case LCD_X_SETCHROMAMODE:
            if (((LCD_X_SETCHROMAMODE_INFO *)pData)->ChromaMode != 0) {
                HAL_LTDC_EnableColorKeying(&hltdc, LayerIndex);
            } else {
                HAL_LTDC_DisableColorKeying(&hltdc, LayerIndex);
            }

            break;

        case LCD_X_SETCHROMA:
            Color = ((((LCD_X_SETCHROMA_INFO *)pData)->ChromaMin & 0xFF0000) >> 16) | \
                    (((LCD_X_SETCHROMA_INFO *)pData)->ChromaMin & 0x00FF00) | \
                    ((((LCD_X_SETCHROMA_INFO *)pData)->ChromaMin & 0x0000FF) << 16);
            HAL_LTDC_ConfigColorKeying(&hltdc, Color, LayerIndex);
            break;

        default:
            r = -1;
    }

    return r;
}

/*******************************************************************************
                          Static code
*******************************************************************************/
/**
    @brief  Initialize the LCD Controller.
    @param  LayerIndex : layer Index.
    @retval None
*/
static void LCD_LL_LayerInit(uint32_t LayerIndex) {
    uint32_t                         i;
    static uint32_t                  LUT[256];
    LTDC_LayerCfgTypeDef             layer_cfg;

    if (LayerIndex < GUI_NUM_LAYERS) {
        /* Layer configuration */
        layer_cfg.WindowX0 = 0;
        layer_cfg.WindowX1 = XSIZE_PHYS;
        layer_cfg.WindowY0 = 0;
        layer_cfg.WindowY1 = YSIZE_PHYS;
        layer_cfg.PixelFormat = LCD_LL_GetPixelformat(LayerIndex);
        layer_cfg.FBStartAdress = layer_prop[LayerIndex].address;
        layer_cfg.Alpha = 255;
        layer_cfg.Alpha0 = 0;
        layer_cfg.Backcolor.Blue = 0;
        layer_cfg.Backcolor.Green = 0;
        layer_cfg.Backcolor.Red = 0;
        layer_cfg.BlendingFactor1 = LTDC_BLENDING_FACTOR1_PAxCA;
        layer_cfg.BlendingFactor2 = LTDC_BLENDING_FACTOR2_PAxCA;
        layer_cfg.ImageWidth = XSIZE_PHYS;
        layer_cfg.ImageHeight = YSIZE_PHYS;
        HAL_LTDC_ConfigLayer(&hltdc, &layer_cfg, LayerIndex);

        /* Enable LUT on demand */
        if (LCD_GetBitsPerPixelEx(LayerIndex) <= 8) {
            /* Enable usage of LUT for all modes with <= 8bpp*/
            HAL_LTDC_EnableCLUT(&hltdc, LayerIndex);
        } else {
            /* Optional CLUT initialization for AL88 mode (16bpp)*/
            if (layer_prop[LayerIndex].pColorConvAPI == GUICC_88666I) {
                HAL_LTDC_EnableCLUT(&hltdc, LayerIndex);

                for (i = 0; i < 256; i++) {
                    LUT[i] = LCD_API_ColorConv_8666.pfIndex2Color(i);
                }

                HAL_LTDC_ConfigCLUT(&hltdc, LUT, 256, LayerIndex);
            }
        }
    }
}

/**
    @brief  Initialize the LCD Controller.
    @param  LayerIndex : layer Index.
    @retval None
*/
static void LCD_LL_Init(void) {
    static RCC_PeriphCLKInitTypeDef  PeriphClkInitStruct;
    BSP_LCD_Init();
    /* DeInit */
//      HAL_LTDC_DeInit(&hltdc);
//      hltdc.Instance = LTDC;
//      hltdc.Init.HSPolarity = LTDC_HSPOLARITY_AL;
//      hltdc.Init.VSPolarity = LTDC_VSPOLARITY_AL;
//      hltdc.Init.DEPolarity = LTDC_DEPOLARITY_AL;
//      hltdc.Init.PCPolarity = LTDC_PCPOLARITY_IPC;
//      hltdc.Init.HorizontalSync = 7;
//      hltdc.Init.VerticalSync = 3;
//      hltdc.Init.AccumulatedHBP = 14;
//      hltdc.Init.AccumulatedVBP = 5;
//      hltdc.Init.AccumulatedActiveW = 654;
//      hltdc.Init.AccumulatedActiveH = 485;
//      hltdc.Init.TotalWidth = 660;
//      hltdc.Init.TotalHeigh = 487;
//      hltdc.Init.Backcolor.Blue = 0;
//      hltdc.Init.Backcolor.Green = 0;
//      hltdc.Init.Backcolor.Red = 0;
//      HAL_LTDC_Init(&hltdc);
    HAL_LTDC_ProgramLineEvent(&hltdc, 272);
    /* Configure the DMA2D  default mode */
    hdma2d.Init.Mode         = DMA2D_R2M;
    hdma2d.Init.ColorMode    = DMA2D_RGB565;
    hdma2d.Init.OutputOffset = 0x0;
    hdma2d.Instance          = DMA2D;

    if (HAL_DMA2D_Init(&hdma2d) != HAL_OK) {
        while (1);
    }
}

/**
    @brief  Return Pixel format for a given layer
    @param  LayerIndex : Layer Index
    @retval Status ( 0 : 0k , 1: error)
*/
static uint32_t LCD_LL_GetPixelformat(uint32_t LayerIndex) {
    const LCD_API_COLOR_CONV *pColorConvAPI;

