Borodkov/STM32-Advanced/STM32F7_Workshop_07_Scope/Src/LCDConf.c
    if (LayerIndex >= GUI_NUM_LAYERS) {
        return 0;
    }

    pColorConvAPI = layer_prop[LayerIndex].pColorConvAPI;

    if (pColorConvAPI == GUICC_M8888I) {
        return LTDC_PIXEL_FORMAT_ARGB8888;
    } else if (pColorConvAPI == GUICC_M888) {
        return LTDC_PIXEL_FORMAT_RGB888;
    } else if (pColorConvAPI == GUICC_M565) {
        return LTDC_PIXEL_FORMAT_RGB565;
    } else if (pColorConvAPI == GUICC_M1555I) {
        return LTDC_PIXEL_FORMAT_ARGB1555;
    } else if (pColorConvAPI == GUICC_M4444I) {
        return LTDC_PIXEL_FORMAT_ARGB4444;
    } else if (pColorConvAPI == GUICC_8666) {
        return LTDC_PIXEL_FORMAT_L8;
    } else if (pColorConvAPI == GUICC_1616I) {
        return LTDC_PIXEL_FORMAT_AL44;
    } else if (pColorConvAPI == GUICC_88666I) {
        return LTDC_PIXEL_FORMAT_AL88;
    }

    while (1);
}

/*********************************************************************

        CopyBuffer
*/
static void DMA2D_CopyBuffer(uint32_t LayerIndex, void *pSrc, void *pDst, uint32_t xSize, uint32_t ySize, uint32_t OffLineSrc, uint32_t OffLineDst) {
    uint32_t PixelFormat;
    PixelFormat = LCD_LL_GetPixelformat(LayerIndex);
    DMA2D->CR      = 0x00000000UL | (1 << 9);
    /* Set up pointers */
    DMA2D->FGMAR   = (uint32_t)pSrc;
    DMA2D->OMAR    = (uint32_t)pDst;
    DMA2D->FGOR    = OffLineSrc;
    DMA2D->OOR     = OffLineDst;
    /* Set up pixel format */
    DMA2D->FGPFCCR = PixelFormat;
    /*  Set up size */
    DMA2D->NLR     = (uint32_t)(xSize << 16) | (U16)ySize;
    DMA2D->CR     |= DMA2D_CR_START;

    /* Wait until transfer is done */
    while (DMA2D->CR & DMA2D_CR_START) {
    }
}

/*********************************************************************

        FillBuffer
*/
static void DMA2D_FillBuffer(uint32_t LayerIndex, void *pDst, uint32_t xSize, uint32_t ySize, uint32_t OffLine, uint32_t ColorIndex) {
    uint32_t PixelFormat;
    PixelFormat = LCD_LL_GetPixelformat(LayerIndex);
    /* Set up mode */
    DMA2D->CR      = 0x00030000UL | (1 << 9);
    DMA2D->OCOLR   = ColorIndex;
    /* Set up pointers */
    DMA2D->OMAR    = (uint32_t)pDst;
    /* Set up offsets */
    DMA2D->OOR     = OffLine;
    /* Set up pixel format */
    DMA2D->OPFCCR  = PixelFormat;
    /*  Set up size */
    DMA2D->NLR     = (uint32_t)(xSize << 16) | (U16)ySize;
    DMA2D->CR     |= DMA2D_CR_START;

    /* Wait until transfer is done */
    while (DMA2D->CR & DMA2D_CR_START) {
    }
}


/*********************************************************************

        GetBufferSize
*/
static uint32_t GetBufferSize(uint32_t LayerIndex) {
    uint32_t BufferSize;
    BufferSize = layer_prop[LayerIndex].xSize * layer_prop[LayerIndex].ySize * layer_prop[LayerIndex].BytesPerPixel;
    return BufferSize;
}

/*********************************************************************

        CUSTOM_CopyBuffer
*/
static void CUSTOM_CopyBuffer(int32_t LayerIndex, int32_t IndexSrc, int32_t IndexDst) {
    uint32_t BufferSize, AddrSrc, AddrDst;
    BufferSize = GetBufferSize(LayerIndex);
    AddrSrc    = layer_prop[LayerIndex].address + BufferSize * IndexSrc;
    AddrDst    = layer_prop[LayerIndex].address + BufferSize * IndexDst;
    DMA2D_CopyBuffer(LayerIndex, (void *)AddrSrc, (void *)AddrDst, layer_prop[LayerIndex].xSize, layer_prop[LayerIndex].ySize, 0, 0);
    layer_prop[LayerIndex].buffer_index = IndexDst;
}

/*********************************************************************

        CUSTOM_CopyRect
*/
static void CUSTOM_CopyRect(int32_t LayerIndex, int32_t x0, int32_t y0, int32_t x1, int32_t y1, int32_t xSize, int32_t ySize) {
    int32_t BufferSize, AddrSrc, AddrDst;
    BufferSize = GetBufferSize(LayerIndex);
    AddrSrc = layer_prop[LayerIndex].address + BufferSize * layer_prop[LayerIndex].pending_buffer + (y0 * layer_prop[LayerIndex].xSize + x0) * layer_prop[LayerIndex].BytesPerPixel;
    AddrDst = layer_prop[LayerIndex].address + BufferSize * layer_prop[LayerIndex].pending_buffer + (y1 * layer_prop[LayerIndex].xSize + x1) * layer_prop[LayerIndex].BytesPerPixel;
    DMA2D_CopyBuffer(LayerIndex, (void *)AddrSrc, (void *)AddrDst, xSize, ySize, layer_prop[LayerIndex].xSize - xSize, 0);
}

/*********************************************************************

        CUSTOM_FillRect
*/
static void CUSTOM_FillRect(int32_t LayerIndex, int32_t x0, int32_t y0, int32_t x1, int32_t y1, uint32_t PixelIndex) {
    uint32_t BufferSize, AddrDst;
    int32_t xSize, ySize;

    if (GUI_GetDrawMode() == GUI_DM_XOR) {
        LCD_SetDevFunc(LayerIndex, LCD_DEVFUNC_FILLRECT, NULL);
        LCD_FillRect(x0, y0, x1, y1);
        LCD_SetDevFunc(LayerIndex, LCD_DEVFUNC_FILLRECT, (void(*)(void))CUSTOM_FillRect);
    } else {
        xSize = x1 - x0 + 1;
        ySize = y1 - y0 + 1;
        BufferSize = GetBufferSize(LayerIndex);
        AddrDst = layer_prop[LayerIndex].address + BufferSize * layer_prop[LayerIndex].buffer_index + (y0 * layer_prop[LayerIndex].xSize + x0) * layer_prop[LayerIndex].BytesPerPixel;
        DMA2D_FillBuffer(LayerIndex, (void *)AddrDst, xSize, ySize, layer_prop[LayerIndex].xSize - xSize, PixelIndex);
    }
}

/**
    @brief
    @param  pColor
    @param  NumItems
    @retval None
*/
static void DMA2D_LoadLUT(LCD_COLOR *pColor, uint32_t NumItems) {
    DMA2D->FGCMAR  = (uint32_t)pColor;
    /*  Foreground PFC Control Register */
    DMA2D->FGPFCCR  = LTDC_PIXEL_FORMAT_RGB888         /* Pixel format */
                      | ((NumItems - 1) & 0xFF) << 8;   /* Number of items to load */
    DMA2D->FGPFCCR |= (1 << 5);                       /* Start loading */
}

/**
    @brief
    @param  pColorSrc: Source address
    @param  pColorDst: Destination address
    @param  NumItems
    @retval None
*/
static void InvertAlpha_SwapRB(LCD_COLOR *pColorSrc, LCD_COLOR *pColorDst, uint32_t NumItems) {
    uint32_t Color;

    do {
        Color = *pColorSrc++;
        *pColorDst++ = ((Color & 0x000000FF) << 16)         /* Swap red <-> blue */
                       | (Color & 0x0000FF00)                 /* Green */
                       | ((Color & 0x00FF0000) >> 16)         /* Swap red <-> blue */
                       | ((Color & 0xFF000000) ^ 0xFF000000); /* Invert alpha */
    } while (--NumItems);
}

/**
    @brief  Color format of DMA2D is different to STemWin color format. This routine
            inverts alpha that it is compatible to STemWin and vice versa
    @param  pColorSrc
    @param  pColorDst
    @param  NumItems
    @retval None
*/
static void InvertAlpha(LCD_COLOR *pColorSrc, LCD_COLOR *pColorDst, uint32_t NumItems) {
    uint32_t Color;

    do {
        Color = *pColorSrc++;
        *pColorDst++ = Color ^ 0xFF000000; /* Invert alpha */
    } while (--NumItems);
}

/**
    @brief
    @param  pColorFG
    @param  pColorBG
    @param  pColorDst
    @param  NumItems
    @retval None
*/
static void DMA2D_AlphaBlendingBulk(LCD_COLOR *pColorFG, LCD_COLOR *pColorBG, LCD_COLOR *pColorDst, U32 NumItems) {
    /* Set up mode */
    DMA2D->CR      = 0x00020000UL | (1 << 9);         /* Control Register (Memory to memory with blending of FG and BG and TCIE) */
    /* Set up pointers */
    DMA2D->FGMAR   = (uint32_t)pColorFG;                   /* Foreground Memory Address Register */
    DMA2D->BGMAR   = (uint32_t)pColorBG;                   /* Background Memory Address Register */
    DMA2D->OMAR    = (uint32_t)pColorDst;                  /* Output Memory Address Register (Destination address) */
    /* Set up offsets */
    DMA2D->FGOR    = 0;                               /* Foreground Offset Register */
    DMA2D->BGOR    = 0;                               /* Background Offset Register */
    DMA2D->OOR     = 0;                               /* Output Offset Register */
    /* Set up pixel format */
    DMA2D->FGPFCCR = LTDC_PIXEL_FORMAT_ARGB8888;       /* Foreground PFC Control Register (Defines the FG pixel format) */
    DMA2D->BGPFCCR = LTDC_PIXEL_FORMAT_ARGB8888;       /* Background PFC Control Register (Defines the BG pixel format) */
    DMA2D->OPFCCR  = LTDC_PIXEL_FORMAT_ARGB8888;       /* Output     PFC Control Register (Defines the output pixel format) */
    /* Set up size */
    DMA2D->NLR     = (uint32_t)(NumItems << 16) | 1;       /* Number of Line Register (Size configuration of area to be transfered) */
    /* Execute operation */
    DMA2D->CR     |= DMA2D_CR_START;

    while (DMA2D->CR & DMA2D_CR_START) {
    }
}

#if defined (__GNUC__) /*!< GNU Compiler */
#pragma GCC optimize ("O0")
#endif
/**
    @brief  Function for mixing up 2 colors with the given intensity.
            If the background color is completely transparent the
            foreground color should be used unchanged.
    @param  Color
    @param  BkColor
    @param  Intens
    @retval LCD_COLOR
*/
static LCD_COLOR DMA2D_MixColors(LCD_COLOR Color, LCD_COLOR BkColor, U8 Intens) {
    uint32_t ColorFG, ColorBG, ColorDst;

    if ((BkColor & 0xFF000000) == 0xFF000000) {
        return Color;
    }

    ColorFG = Color   ^ 0xFF000000;
    ColorBG = BkColor ^ 0xFF000000;
    /* Set up mode */
    DMA2D->CR      = 0x00020000UL | (1 << 9);         /* Control Register (Memory to memory with blending of FG and BG and TCIE) */
    /* Set up pointers */
    DMA2D->FGMAR   = (uint32_t)&ColorFG;                   /* Foreground Memory Address Register */
    DMA2D->BGMAR   = (uint32_t)&ColorBG;                   /* Background Memory Address Register */
    DMA2D->OMAR    = (uint32_t)&ColorDst;                  /* Output Memory Address Register (Destination address) */
    /* Set up pixel format */
    DMA2D->FGPFCCR = LTDC_PIXEL_FORMAT_ARGB8888
                     | (1UL << 16)
                     | ((uint32_t)Intens << 24);
    DMA2D->BGPFCCR = LTDC_PIXEL_FORMAT_ARGB8888
                     | (0UL << 16)
                     | ((uint32_t)(255 - Intens) << 24);
    DMA2D->OPFCCR  = LTDC_PIXEL_FORMAT_ARGB8888;
    /* Set up size */
    DMA2D->NLR     = (uint32_t)(1 << 16) | 1;              /* Number of Line Register (Size configuration of area to be transfered) */
    /* Execute operation */
    DMA2D->CR     |= DMA2D_CR_START;                               /* Control Register (Start operation) */

    /* Wait until transfer is done */
    while (DMA2D->CR & DMA2D_CR_START) {
    }

    return (ColorDst ^ 0xFF000000);
}

/**
    @brief
    @param  pSrc
    @param  pDst
    @param  PixelFormatSrc
    @param  PixelFormatDst
    @param  NumItems
    @retval None
*/
static void DMA2D_ConvertColor(void *pSrc, void *pDst,  uint32_t PixelFormatSrc, uint32_t PixelFormatDst, uint32_t NumItems) {
    /* Set up mode */
    DMA2D->CR      = 0x00010000UL | (1 << 9);         /* Control Register (Memory to memory with pixel format conversion and TCIE) */
    /* Set up pointers */
    DMA2D->FGMAR   = (uint32_t)pSrc;                       /* Foreground Memory Address Register (Source address) */
    DMA2D->OMAR    = (uint32_t)pDst;                       /* Output Memory Address Register (Destination address) */
    /* Set up offsets */
    DMA2D->FGOR    = 0;                               /* Foreground Offset Register (Source line offset) */
    DMA2D->OOR     = 0;                               /* Output Offset Register (Destination line offset) */
    /* Set up pixel format */
    DMA2D->FGPFCCR = PixelFormatSrc;                  /* Foreground PFC Control Register (Defines the input pixel format) */
    DMA2D->OPFCCR  = PixelFormatDst;                  /* Output PFC Control Register (Defines the output pixel format) */
    /* Set up size */
    DMA2D->NLR     = (uint32_t)(NumItems << 16) | 1;       /* Number of Line Register (Size configuration of area to be transfered) */
    /* Execute operation */
    DMA2D->CR     |= DMA2D_CR_START;

    while (DMA2D->CR & DMA2D_CR_START) {
    }
}

/**
    @brief  The STemWin function LCD_GetpPalConvTable() normally translates the given colors into
            index values for the display controller. In case of index based bitmaps without
            transparent pixels we load the palette only to the DMA2D LUT registers to be
            translated (converted) during the process of drawing via DMA2D.
    @param  pLogPal
    @param  pBitmap
    @param  LayerIndex
    @retval LCD_PIXELINDEX
*/
static LCD_PIXELINDEX *_LCD_GetpPalConvTable(const LCD_LOGPALETTE GUI_UNI_PTR *pLogPal, const GUI_BITMAP GUI_UNI_PTR *pBitmap, int LayerIndex) {
    void (* pFunc)(void);
    int32_t DoDefault = 0;

    /* Check if we have a non transparent device independent bitmap */
    if (pBitmap->BitsPerPixel == 8) {
        pFunc = LCD_GetDevFunc(LayerIndex, LCD_DEVFUNC_DRAWBMP_8BPP);

        if (pFunc) {
            if (pBitmap->pPal) {
                if (pBitmap->pPal->HasTrans) {
                    DoDefault = 1;
                }
            } else {
                DoDefault = 1;
            }
        } else {
            DoDefault = 1;
        }
    } else {
        DoDefault = 1;
    }

