Borodkov/STM32-Advanced/STM32F7_Workshop_07_Scope/Src/LCDConf.c
    /* Default palette management for other cases */
    if (DoDefault) {
        /* Return a pointer to the index values to be used by the controller */
        return LCD_GetpPalConvTable(pLogPal);
    }

    /* Convert palette colors from ARGB to ABGR */
    InvertAlpha_SwapRB((U32 *)pLogPal->pPalEntries, aBufferDMA2D, pLogPal->NumEntries);
    /* Load LUT using DMA2D */
    DMA2D_LoadLUT(aBufferDMA2D, pLogPal->NumEntries);
    /* Return something not NULL */
    return aBufferDMA2D;
}

/**
    @brief
    @param  pColorFG
    @param  pColorBG
    @param  pColorDst
    @param  Intens
    @param  NumItems
    @retval None
*/
static void DMA2D_MixColorsBulk(LCD_COLOR *pColorFG, LCD_COLOR *pColorBG, LCD_COLOR *pColorDst, U8 Intens, uint32_t NumItems) {
    /* Set up mode */
    DMA2D->CR      = 0x00020000UL | (1 << 9);         /* Control Register (Memory to memory with blending of FG and BG and TCIE) */
    /* Set up pointers */
    DMA2D->FGMAR   = (uint32_t)pColorFG;                   /* Foreground Memory Address Register */
    DMA2D->BGMAR   = (uint32_t)pColorBG;                   /* Background Memory Address Register */
    DMA2D->OMAR    = (uint32_t)pColorDst;                  /* Output Memory Address Register (Destination address) */
    /* Set up pixel format */
    DMA2D->FGPFCCR = LTDC_PIXEL_FORMAT_ARGB8888
                     | (1UL << 16)
                     | ((uint32_t)Intens << 24);
    DMA2D->BGPFCCR = LTDC_PIXEL_FORMAT_ARGB8888
                     | (0UL << 16)
                     | ((uint32_t)(255 - Intens) << 24);
    DMA2D->OPFCCR  = LTDC_PIXEL_FORMAT_ARGB8888;
    /* Set up size */
    DMA2D->NLR     = (uint32_t)(NumItems << 16) | 1;              /* Number of Line Register (Size configuration of area to be transfered) */
    /* Execute operation */
    DMA2D->CR     |= DMA2D_CR_START;

    while (DMA2D->CR & DMA2D_CR_START) {
    }
}

/**
    @brief
    @param  pColorFG
    @param  pColorBG
    @param  pColorDst
    @param  NumItems
    @retval None
*/
static void DMA2D_AlphaBlending(LCD_COLOR *pColorFG, LCD_COLOR *pColorBG, LCD_COLOR *pColorDst, U32 NumItems) {
    /* Invert alpha values */
    InvertAlpha(pColorFG, aBuffer_FG, NumItems);
    InvertAlpha(pColorBG, aBuffer_BG, NumItems);
    /* Use DMA2D for mixing */
    DMA2D_AlphaBlendingBulk(aBuffer_FG, aBuffer_BG, aBufferDMA2D, NumItems);
    /* Invert alpha values */
    InvertAlpha(aBufferDMA2D, pColorDst, NumItems);
}

/**
    @brief  This routine is used by the STemWin color conversion routines to use DMA2D for
            color conversion. It converts the given index values to 32 bit colors.
            Because STemWin uses ABGR internally and 0x00 and 0xFF for opaque and fully
            transparent the color array needs to be converted after DMA2D has been used.
    @param  pIndex
    @param  pColor
    @param  NumItems
    @param  SizeOfIndex
    @param  PixelFormat
    @retval None
*/
static void DMA2D_Index2ColorBulk(void *pIndex, LCD_COLOR *pColor, uint32_t NumItems, U8 SizeOfIndex, uint32_t PixelFormat) {
    /* Use DMA2D for the conversion */
    DMA2D_ConvertColor(pIndex, aBufferDMA2D, PixelFormat, LTDC_PIXEL_FORMAT_ARGB8888, NumItems);
    /* Convert colors from ARGB to ABGR and invert alpha values */
    InvertAlpha_SwapRB(aBufferDMA2D, pColor, NumItems);
}

/**
    @brief  This routine is used by the STemWin color conversion routines to use DMA2D for
            color conversion. It converts the given 32 bit color array to index values.
            Because STemWin uses ABGR internally and 0x00 and 0xFF for opaque and fully
            transparent the given color array needs to be converted before DMA2D can be used.
    @param  pColor
    @param  pIndex
    @param  NumItems
    @param  SizeOfIndex
    @param  PixelFormat
    @retval None
*/
static void DMA2D_Color2IndexBulk(LCD_COLOR *pColor, void *pIndex, uint32_t NumItems, U8 SizeOfIndex, uint32_t PixelFormat) {
    /* Convert colors from ABGR to ARGB and invert alpha values */
    InvertAlpha_SwapRB(pColor, aBufferDMA2D, NumItems);
    /* Use DMA2D for the conversion */
    DMA2D_ConvertColor(aBufferDMA2D, pIndex, LTDC_PIXEL_FORMAT_ARGB8888, PixelFormat, NumItems);
}

/**
    @brief
    @param  pFG
    @param  pBG
    @param  pDst
    @param  OffFG
    @param  OffBG
    @param  OffDest
    @param  xSize
    @param  ySize
    @param  Intens
    @retval None
*/
static void LCD_MixColorsBulk(U32 *pFG, U32 *pBG, U32 *pDst, unsigned OffFG, unsigned OffBG, unsigned OffDest, unsigned xSize, unsigned ySize, U8 Intens) {
    int32_t y;
    GUI_USE_PARA(OffFG);
    GUI_USE_PARA(OffDest);

    for (y = 0; y < ySize; y++) {
        /* Invert alpha values */
        InvertAlpha(pFG, aBuffer_FG, xSize);
        InvertAlpha(pBG, aBuffer_BG, xSize);
        DMA2D_MixColorsBulk(aBuffer_FG, aBuffer_BG, aBufferDMA2D, Intens, xSize);
        InvertAlpha(aBufferDMA2D, pDst, xSize);
        pFG  += xSize + OffFG;
        pBG  += xSize + OffBG;
        pDst += xSize + OffDest;
    }
}

/**
    @brief
    @param  pSrc
    @param  pDst
    @param  OffSrc
    @param  OffDst
    @param  PixelFormatDst
    @param  xSize
    @param  ySize
    @retval None
*/
static void DMA2D_DrawBitmapL8(void *pSrc, void *pDst,  uint32_t OffSrc, uint32_t OffDst, uint32_t PixelFormatDst, uint32_t xSize, uint32_t ySize) {
    /* Set up mode */
    DMA2D->CR      = 0x00010000UL | (1 << 9);         /* Control Register (Memory to memory with pixel format conversion and TCIE) */
    /* Set up pointers */
    DMA2D->FGMAR   = (uint32_t)pSrc;                       /* Foreground Memory Address Register (Source address) */
    DMA2D->OMAR    = (uint32_t)pDst;                       /* Output Memory Address Register (Destination address) */
    /* Set up offsets */
    DMA2D->FGOR    = OffSrc;                          /* Foreground Offset Register (Source line offset) */
    DMA2D->OOR     = OffDst;                          /* Output Offset Register (Destination line offset) */
    /* Set up pixel format */
    DMA2D->FGPFCCR = LTDC_PIXEL_FORMAT_L8;             /* Foreground PFC Control Register (Defines the input pixel format) */
    DMA2D->OPFCCR  = PixelFormatDst;                  /* Output PFC Control Register (Defines the output pixel format) */
    /* Set up size */
    DMA2D->NLR     = (uint32_t)(xSize << 16) | ySize;      /* Number of Line Register (Size configuration of area to be transfered) */
    /* Execute operation */
    DMA2D->CR     |= DMA2D_CR_START;                               /* Start operation */

    /* Wait until transfer is done */
    while (DMA2D->CR & DMA2D_CR_START) {
    }
}

/**
    @brief
    @param  LayerIndex
    @param  x
    @param  y
    @param  p
    @param  xSize
    @param  ySize
    @param  BytesPerLine
    @retval None
*/
static void BSP_LCD_DrawBitmap16bpp(int32_t LayerIndex, int32_t x, int32_t y, U16 const *p, int32_t xSize, int32_t ySize, int32_t BytesPerLine) {
    uint32_t BufferSize, AddrDst;
    int32_t OffLineSrc, OffLineDst;
    BufferSize = GetBufferSize(LayerIndex);
    AddrDst = layer_prop[LayerIndex].address + BufferSize * layer_prop[LayerIndex].buffer_index + (y * layer_prop[LayerIndex].xSize + x) * layer_prop[LayerIndex].BytesPerPixel;
    OffLineSrc = (BytesPerLine / 2) - xSize;
    OffLineDst = layer_prop[LayerIndex].xSize - xSize;
    DMA2D_CopyBuffer(LayerIndex, (void *)p, (void *)AddrDst, xSize, ySize, OffLineSrc, OffLineDst);
}

/**
    @brief
    @param  LayerIndex
    @param  x
    @param  y
    @param  p
    @param  xSize
    @param  ySize
    @param  BytesPerLine
    @retval None
*/
static void BSP_LCD_DrawBitmap8bpp(int32_t LayerIndex, int32_t x, int32_t y, U8 const *p, int32_t xSize, int32_t ySize, int32_t BytesPerLine) {
    uint32_t BufferSize, AddrDst;
    int32_t OffLineSrc, OffLineDst;
    uint32_t PixelFormat;
    BufferSize = GetBufferSize(LayerIndex);
    AddrDst = layer_prop[LayerIndex].address + BufferSize * layer_prop[LayerIndex].buffer_index + (y * layer_prop[LayerIndex].xSize + x) * layer_prop[LayerIndex].BytesPerPixel;
    OffLineSrc = BytesPerLine - xSize;
    OffLineDst = layer_prop[LayerIndex].xSize - xSize;
    PixelFormat = LCD_LL_GetPixelformat(LayerIndex);
    DMA2D_DrawBitmapL8((void *)p, (void *)AddrDst, OffLineSrc, OffLineDst, PixelFormat, xSize, ySize);
}
/*************************** End of file ****************************/
